## 背景: 
- 具備按軸自動或顯示數據對齊功能的數據結構
- 集成時間序列功能
- 處理非時間序列數據
- 數學運算和約簡，根據不同的元數據(軸編號)執行
- 靈活處理缺失數據
- 合併及其他出現在常見數據庫中的關係型運算

## pandas 引入約定

In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 主要數據結構
- Series
- DataFrame

### Series
- 類似於一維數組的對象，由一組數據(各種NumPy數據類型)以及一組與之相關的數據標籤(即索引)組成

In [6]:
# 左邊: 索引。    若無為數據指定索引，則自動創建0~N-1的整數型索引
# 右邊: 值
obj = Series([5, 7, -5, 3])
obj

0    5
1    7
2   -5
3    3
dtype: int64

In [8]:
# 數組表示形式
obj.values

array([ 5,  7, -5,  3])

In [12]:
# 數組索引對象
obj.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
# 指定索引
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [18]:
# 透過索引的方式選取series中的單個值:
obj2['a']

-5

In [25]:
# 透過索引的方式選取series中的一組值:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [23]:
# 透過索引的方式指定series中的單個或一組值:
obj2['b'] = 6
obj2

d    4
b    6
a   -5
c    3
dtype: int64

In [27]:
# NumPy數組運算(如根據布林型數組進行過濾、標量乘法、應用數學函數等)都會保留索引與值之間的鍊接
obj2[obj2 > 0]

d    4
b    6
c    3
dtype: int64

In [28]:
obj * 2

0    10
1    14
2   -10
3     6
b    12
dtype: int64

In [32]:
import numpy as np
np.exp(obj2)

d     54.598150
b    403.428793
a      0.006738
c     20.085537
dtype: float64

In [33]:
# 將Series看成是一個定長的有序字典(dictionary)，索引值到數據值的一個映射
'b' in obj2

True

In [34]:
# 直接透過字典創建Series
# 若只傳入一個字典，則結果Series中的索引就是原字典的健(key)(有序排列)
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [35]:
# sdata中跟states索引相匹配的那3個值會被找出來並放到相應的位置上；缺失值則使用NaN(not a number)表示
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

#### 檢測缺失數據(後)

In [36]:
# pandas: isnull() 檢測缺失數據
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
# pandas: notnull() 檢測缺失數據
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [39]:
# Series: isnull() 檢測缺失數據
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

#### 對齊不同索引數據(後)

In [40]:
# 在算術運算中自動對齊不同索引的數據
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [41]:
# Series對象本身及其索引都有一個name屬性
obj4.name = 'population'
obj.index.name = 'state'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [47]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      5
Steve    7
Jeff    -5
Ryan     3
lolo     6
dtype: int64

### DataFrame
- 表格型的數據結構
- 包含一組有序的列，每列可以是不同的值類型(數值、字符串、布林值等)
- 有行索引與列索引，可以看成是由Series組成的字典(更用同一個索引)
- 內部的數據是以一個或多個二維塊存放(而不是列表、字典或別的一維數據結構)+

In [51]:
# 建構DataFrame: 傳入一個由等長列表(list)或NumPy數組組成的字典
# DataFrame會自動加上索引(與Series一樣)，且全部列會被有序排列
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [52]:
# 若指令了列序列，則將會按照指令順序進行排列
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [54]:
# 與Series相同，若傳入的列在數據中找不到，則產生NaN
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [55]:
# 獲取列資訊
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [56]:
# 透過字典標記的方式或屬性的方式，將DataFrame的列獲取為一個Series
# 返回的Series擁有原DataFrame相同的索引，且其name屬性也已經被相應地設置好了
# 與frame2.state得到相同結果
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [59]:
# 行資訊可以透過位置或名稱的方式獲得，譬如用索引字段ix
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [61]:
# 列可以透過賦值的方式進行修改
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [63]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [64]:
# 將列表或數組賦值給某列時，其長度必須跟DataFrame的長度相匹配。
# 若使用Series進行賦值，則將與DataFrame的索引進行精確匹配，且自動填入缺失值
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [73]:
# 為不存在的列賦值，會創建出一個新列
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [74]:
# del用於刪除列
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [ ]:
# 通過索引方式返回的列只是相應數據的視圖而已，對返回的Series所做的任何修改皆會反應到源DataFrame上
# 透過Series的cop方法即可顯示地複製列

In [76]:
# 使用嵌套字典(字典的字典)，創建DataFrame；外層字典的健作為列，內層健作為行索引
# 內層字典的健會被合併、排序以形成最終的索引
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [77]:
# 將frame進行轉置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [83]:
# 若顯示指定索引，則只會顯示指定索引的相關資料
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [84]:
# 使用Series組成的字典，創建DataFrame
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

|類型|說明|
|----|---|
|二維ndarray|數據陣列，還可以傳入行標和列標|
|由數組、列表或元祖組成的字典|每個序列會變成DataFrame的一列。所有序列的長度必須相同|
|NumPy的結構化/紀錄數組|類似於"由數組組成的字典"|
|由Series組成的字典|每個Series會成為一列。如果沒有顯示指定索引，則個Series的索引會被合併成結果的行索引|
|由字典組成的字典|各內層字典會變成一列。鍵會被合併成結果的行索引，跟"由Series組成的字典"的情況一樣|
|字典或Series的列表|各項將會成為DataFrame的一行。字典鍵或Series索引的並集將會成為DataFrame的列標|
|由列表或元組組成的列表|類似於"二維ndarray"|
|另一個DataFrame|該DataFrame的索引將被沿用，除非顯示指定了其他索引|
|NumPy的MaskedArray|類似於"二維ndarray"的情況，只是掩碼值在結果DataFrame會變成缺失值|

In [85]:
# 若設置DataFrame的index和columns的name屬性，則這些信息將會被顯示出來
frame3.index.name ='year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [86]:
# 與Series相同，values屬性也會以二維ndarray的形式返回DataFrame中的數據
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [87]:
# 若DataFrame各列的數據類型不同，則值數組的數據類型就會選用能兼容所有列的數據類型
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### 索引對象
- pandas的索引對象負責管理軸標籤和其他元數據(譬如軸名稱等)
- 建構Series或DataFrame時，所用到的任何數組或其他序列的標籤都會被轉換成一個Index
- Index對象是不可修改的(immutable)，此特性讓Index對象在多個數據結構之千安全共享
- Index可以被繼承從而實踐特別的軸索引功能

In [88]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [89]:
index[1:]

Index([u'b', u'c'], dtype='object')

#### pandas中主要的Index對象
|類|說明|
|--|----|
|Index|最泛化的Index對象，將軸標籤表示為一個由Python對象組成的NumPy數組|
|Int64Index|針對整數的特殊Index|
|MultiIndex|"層次化"索引對象表示單個軸上的多層索引。可以看作由元組組成的數組|
|DatatimeIndex|存儲奈秒級時間戳(用NumPy的datetime63類型表示)|
|PeriodIndex|針對Period數據(時間間隔)的特殊Index|

In [92]:
# Index的功能類似一個固定大小的集合
'Ohio' in frame3.columns

True

#### Index的方法和屬性
|方法|說明|
|----|---|
|append|連接另一個Index對象，產生一個新的Index|
|diff|計算差集，並得到一個Index|
|intersection|計算交集|
|union|計算並集|
|isin|計算一個指示各值是否都包含在參數集合中的布林型數組|
|delete|刪除索引i處的元素，並得到新的Index|
|drop|刪除傳入的值，並得到新的Index|
|insert|將元素插入到索引i處，並得到新的Index|
|is_monotonic|當各元素缺大於等於錢一個元素時，返回True|
|is_unique|當Index沒有重複值時，返回True|
|unique|計算Index中唯一值的數組|

## 基本功能

### 重新索引
- pandas對象的重要方法reindex，其作用是創建一個適應新索引的新對象

In [93]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [94]:
# Series的reindex將會根據新索引進行重排。若某索引值當前不存在，就引入缺失值
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [95]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [98]:
# 對於時間序列這樣的有序數據，重新索引時可能需要做一些插值處理。
# method選項可以達成上述目的
# 例如，使用ffill可以實現前項值填充
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

#### reindex的(插值)method選項
|參數|說明|
|----|---|
|ffill或pad|前向填充(或搬運)值|
|bfill或backfill|後向填充(或搬運)值|

In [106]:
# 對於DataFrame, reindex可以修改(行)索引、列或兩個都修改。如果僅傳入一個序列，則會重新索引行
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                 columns=['Ohio', 'Texas', 'California']) 
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [101]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  Californua
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [107]:
# 使用columns關鍵字即可重新索引列
states = ['Texas', 'Utat', 'California']
frame.reindex(columns=states)

   Texas  Utat  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [108]:
# 同時對行與列進行重新索引，而插值則只能按行應用
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
             columns=states)

   Texas  Utat  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [110]:
# 利用ix的標籤索引功能，重新索引任務可以變得更簡潔
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utat  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### reindex函數的各參數及說明

|參數|說明|
|----|---|
|index|用作索引的新序列。既可以是Index實例，也可以是其他序列型的Python數據結構。Index會被完全使用，就像沒有任何複製一樣|
|method|插值(填充)方式|
|fill_value|在重新索引的過程中，需要引入缺失值時使用的替代值|
|limit|前向或後向填充時的最大填充值|
|level|在MultiIndex的指定級別上匹配簡單索引，否則選取其子集|
|copy|默認為True，無論如何都複製：如果為False，則新舊相等就不複製|

#### 丟棄指定軸上的項
- 使用一個索引數組，或者列表，即可丟棄某條軸上的一個或多個項
- 透過drop方法返回一個在指定軸上刪除指定值後的新對象，達成執行一些數據整理和集合邏輯

In [111]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [112]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [113]:
# 對於DataFrame，可以刪除任意軸上的索引值
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [114]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [116]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### 索引、選取和過濾
- Series索引(obj[...])的工作方式類似於NumPy數組的索引，只不過Series的索引值不只是整數

In [119]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [120]:
obj['b']

1.0

In [121]:
obj[1]

1.0

In [122]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [123]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [124]:
# 利用標籤的切片運算與普通的Python切片運算不同，其末端是包含的(inclusive)
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [125]:
# 設置方式
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [126]:
# 對DataFrame進行索引其實就是或許一個或多個列
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [130]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [131]:
# 透過切片進行取行
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [132]:
# 透過布林數組進行取行
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
# 透過布林型DataFrame進行索引
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [135]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [136]:
# 為了在DataFrame的行上進行標籤索引，引入專門的索引字段ix，
# 以便通過NumPy的標記法以及軸標籤從DataFrame中選取行和列的子集
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [137]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [138]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [139]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

#### DataFrame的索引選項 (簡單總結針對DataFrame數據的大部分選取和重排方式)
|類型|說明|
|---|----|
|obj[val]|選取DataFrame的單個列或一組列。在一些特殊情況下會比較便利: 布林型數組(過濾行)、切片(行切片)、布林型DataFrame(根據條件設置值)|
|obj.ix[val]|選取DataFrame的單個行或一組行|
|obj.ix[:,val]|選取單個列或列子集|
|obj.ix[val1,val2]|同時選取行和列|
|reindex方法|將一個或多個軸匹配到新索引|
|xs方法|根據標籤選取單行或單列，並返回一個Series|
|icol、irow方法|根據整數位置選取單列或單行，並返回一個Series|
|get_value、set_value方法|根據行標籤和列標籤選取某個值|

### 算數運算和數據對齊
- 對不同索引的對象進行算數運算。
- 在對象相加時，如果存在不同的索引對，則結果的索引就是該索引對的並集

In [2]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [ ]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

In [ ]:
# 自動的數據對其操作在不重疊的索引處引入NaN值，缺失值會在算數運算過程中傳播
s1 + s2

In [5]:
# 對於DataFrame，對齊操作會同時發生在行與列上
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [6]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [7]:
# 把它們相加後將會返回一個新的DataFrame，將索引和列為原來那兩個DataFrame的並集
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 在算數方法中填充值
- 在對不同索引的對象進行算數運算時，可能希望當一個對象中某個軸標籤在另一個對象中找不到時候填充一個特殊值

In [9]:
df1 = DataFrame(np.arange(12.).reshape((3 ,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [10]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [11]:
# 兩者相加時，沒有重疊的位置，就會產生NaN值
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [12]:
# 使用df1的add方法，傳入df2以及一個fill_value參數
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
# 在對Series或DataFrame重新索引時，指定一個填充值
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### 靈活的算數方法
|方法|說明|
|---|----|
|add|用於加法(+)的方法|
|sub|用於減法(-)的方法|
|div|用於除法(/)的方法|
|mul|用於乘法(*)的方法|

In [ ]:
#### DataFrame和Series之間的運算

In [14]:
# 計算一個二維數組與其某行之間的差，將透過廣播的方式進行
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [15]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [17]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [18]:
# 默認情況下，DataFrame和Series之間的算數運算會將Series的索引匹配到DataFrame的列，然後沿著行一直向下廣播
frame = DataFrame(np.arange(12.).reshape((4 , 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [19]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [27]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [30]:
# 如果某個索引值在DataFrame的列或Series的索引中找不到，則參與運算的兩個對象就會被重新索引以形成並集
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [31]:
# 若希望匹配行且在列上廣播，則必須使用算數運算方法
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [32]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [34]:
# 傳入的軸號就是希望匹配的軸，此例中是匹配DataFrame的行索引並進行廣播
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### 函數應用和映射
- NumPy的ufuncs(元素級數組方法)也可以用於操作pandas對象

In [36]:
frame = DataFrame(np.random.randn(4 ,3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.290732 -1.734241  0.103261
Ohio   -0.876930 -0.876554 -0.511865
Texas   0.312729 -0.512746 -0.748721
Oregon -1.127014 -2.015682 -0.558583

In [37]:
np.abs(frame)

               b         d         e
Utah    0.290732  1.734241  0.103261
Ohio    0.876930  0.876554  0.511865
Texas   0.312729  0.512746  0.748721
Oregon  1.127014  2.015682  0.558583

In [39]:
# 將函數應用到由各列或行所形成的一堆數組上，DataFrame的apply方法即可實現此功能
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.439744
d    1.502935
e    0.851982
dtype: float64

In [40]:
frame.apply(f, axis=1)

Utah      2.024973
Ohio      0.365065
Texas     1.061450
Oregon    1.457099
dtype: float64

#### 許多最常見的數組統計功能都被實現成DataFrame的方法(如sum和mean)，因此無需使用apply方法

In [41]:
# 除標量值外，傳遞給apply的函數還可以返回由多個值組成的Series
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.127014 -2.015682 -0.748721
max  0.312729 -0.512746  0.103261

In [42]:
# 元素級的Python函數也是可以用的，例如想得到frame中各個浮點值的格式化字符串，使用applymap即可
format = lambda x: '%.2f' %x
frame.applymap(format)

            b      d      e
Utah     0.29  -1.73   0.10
Ohio    -0.88  -0.88  -0.51
Texas    0.31  -0.51  -0.75
Oregon  -1.13  -2.02  -0.56

In [43]:
# 之所以叫applymap，是因為Series有一個用於應用元素級函數的map方法
frame['e'].map(format)

Utah       0.10
Ohio      -0.51
Texas     -0.75
Oregon    -0.56
Name: e, dtype: object

#### 排序和排名
- 根據條件對數據集排序(sorting)，是一種重要的內置運算
- 對行或列索引進行排序(按字典順序)，可使用sort_index方法，將返回一個已排序的新對象

In [45]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [49]:
# 對於DataFrame，則可以根據任一個軸上的索引進行排序
frame = DataFrame(np.arange(8).reshape((2,  4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [56]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [55]:
# 數據默認是按升序排序的，但也可以降序排序
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [69]:
# 若要按值對Series進行排序，可使用order方法
obj = Series([4, 7, -3, 2])
# obj.order()
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [68]:
# 在排序時，任何缺失值默認都會被放到Series的末尾
obj = Series([4, np.nan, 7, np.nan, -3, 2])
# obj.order()
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [61]:
# 在DataFrame上，若希望根據一個或多個列中的值進行排序，將一個或多個列的名字傳遞給by選項，即可達到該目的
frame = DataFrame({'b': [4, 7, -3, 2], 'a':[0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [67]:
# frame.sort_index(by='b')
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [66]:
# 根據多個列進行排序，傳入名稱的列表即可
# frame.sort_index(by=['a', 'b'])
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

#### 排名(ranking)
- 排名(ranking)跟排序關係密切，它會增設一個排名值(從1開始，一直到數組中有效數據的數量)
- 與numpy.argsort產生的間接排序索引差不多，不過可以根據某種規則破壞平級關係
- 默認情況下，rank是通過"為各組分配一個平均排名"的方式破壞平級關係的

In [70]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [71]:
# 根據值在原數據中出現的順序給出排名
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [72]:
# 降序排名
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [74]:
# DataFrame可以在行或列上計算排名
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a':[0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [75]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

#### 排名時用於破壞平級關係的method選項
|method|說明|
|------|----|
|'average'|默認: 在相等分組中，為各個值分配平均排名|
|'min'|使用整個分組的最小排名|
|'max'|使用整個分組的最大排名|
|'first'|按值在原始數據中的出現順序分配排名|

In [ ]:
#### 帶有重複值的軸索引
- 許多pandas函數(如reindex)都要求標籤唯一，但這並不是強制性的

In [76]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [77]:
# 索引的is_unique屬性可以判斷它的值是否是唯一的
obj.index.is_unique

False

In [78]:
# 對於帶有重複值的索引，數據選取的行為將會有些不同。如果某個索引對應多個值，則會返回一個Series，而對應單個值的，則返回一個標量值
obj['a']

a    0
a    1
dtype: int64

In [79]:
obj['c']

4

In [81]:
# DataFrame的行進行索引時，也是相同
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.760555 -0.280830 -1.712314
a  1.071885 -0.636966  1.282312
b -0.191544 -0.687806  0.883526
b -0.665674  0.047315 -0.990492

In [82]:
df.ix['b']

          0         1         2
b -0.191544 -0.687806  0.883526
b -0.665674  0.047315 -0.990492

### 匯總和計算描述統計
- 約簡和匯總統計，用於Series中提取單個值(如sum或mean)，或從DataFrame的行或列中提取一個Series
- 皆基於沒有缺失數據的假設而構建的

In [4]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
# 傳入axis=1，將會按行進行求和運算
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [12]:
# NA值會自動被排除，除非整個切片(這裡指的是行或列)都是NA。通過skipna選項可以禁用該功能
df.mean(axis=1, skipna=False)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

#### 約簡方法的選項
|選項|說明|
|---|----|
|axis|約簡的軸。DataFrame的行用0，列用1|
|spipna|排除缺失值，默認值為True|
|level|如果軸是層次化索引的(即MultiIndex)，則根據level分組約簡|

In [14]:
# 有些方法(如idxmin和idxmax)返回的是間接統計(比如達到最小值或最大值的)
df.idxmax()

one    b
two    d
dtype: object

In [15]:
# 有些方法則是累計型的
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [16]:
# 有些方法既不是約簡型的也不是累計型。describe用於一次性產生多個匯總統計
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [17]:
# 對於非數值型數據，describe會產生另外一種匯總統計 
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### 所有與描述統計相關的方法
|方法|說明|
|----|---|
|count|非NA值的數量|
|describe|針對Series或各DataFrame列計算匯總統計|
|min、max|計算最大值和最小值|
|argmin、argmax|計算能夠獲取最小值和最大值的索引位置(整數)|
|idxmin、idxmax|針對能夠獲取到最小值和最大值的索引值|
|quantile|計算樣本的分位數(0到1)|
|sum|值的總和|
|mean|值的平均數|
|median|值的算數中位數(50%分位數)|
|mad|根據平均值計算平均絕對離差|
|var|樣本值的方差|
|std|樣本值的標準差|
|skew|樣本值的偏度(三階距)|
|kurt|樣本值的峰度(四階距)|
|cumsum|樣本值的累計和|
|cummin，cummax|樣本值的累計最大值和累計最小值|
|cumprod|樣本值的累計積|
|diff|計算一階差分(對時間序列很有用)|
|pct_change|計算百分數變化|

#### 相關係數與協方差
- 有些匯總統計(如相關係數和協方差)是通過參數對計算出來的

In [21]:
import pandas.io.data as web
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
               all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2015')
price = DataFrame({tic: data['Adj Close']
                       for tic, data in all_data.iteritems()})

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

#### 唯一值、值計數以及成員資格
- 此類方法可以從一維Series的值中抽取信息

In [22]:
obj = Series(['c', 'a', 'd', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    b
5    b
6    c
7    c
dtype: object

In [24]:
# unique，可以得到Series中的唯一值數組，可以透過sort()進行排序
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [25]:
# value_counts用於計算一個Series中各值出現的頻率，其結果
obj.value_counts()

c    3
b    2
a    2
d    1
dtype: int64

In [27]:
# value_counts可以用於任何數組或序列
pd.value_counts(obj.values, sort=False)

c    3
b    2
a    2
d    1
dtype: int64

In [29]:
# isin，用於判斷矢量化集合的成員資格，可用於選取Series中或DataFrame列中數據的子集
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4     True
5     True
6     True
7     True
dtype: bool

In [31]:
obj[mask]

0    c
4    b
5    b
6    c
7    c
dtype: object

#### 唯一值、值計數、成員資格方法
|方法|說明|
|---|----|
|isin|計算一個表示"Series各值是否包含於傳入的值序列中"的布林值數組|
|unique|計算Series中的唯一值數組，按發現的順序返回|
|value_counts|返回一個Series，其索引為唯一值，其值為頻率，按計數值降序排列|

In [32]:
# 得到DataFrame中多個相關列的一張柱狀圖
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [33]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 處理缺失數據
- 缺失數據(missing data)在大部分數據分析應用中都很常見
- pandas的設計目標之一就是讓缺失數據的處理任務盡量輕鬆

In [34]:
# pandas使用浮點值NaN(Not a Number表示浮點和非浮點數組中的缺失數據。只是一個便於被檢測出來的標記而已
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [35]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [37]:
# Python內置的None值也會被當作NA處理
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### NA處理方法
|方法|說明|
|---|----|
|dropna|根據各標籤的值中是否存在缺失數據對軸標籤進行過濾，可通過閥值調節對缺失值的容忍度|
|fillna|用指定值或插值方法(如ffill或bfill)填充缺失數據|
|isnull|返回一個含有布林值的對象，這些布林值代表哪些值是缺失值NA，該對象的類型與源類型一樣|
|notnull|isnull的否定式|

#### 濾除缺失數據
- dropna，對一個Series返回一個僅含非空數據的索引值的Series

In [39]:
data = Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [40]:
# 也可以透過布林型態索引達到相同目的
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [41]:
# 對於DataFrame對象，dropna默認丟棄任何含有缺失值的行
data = DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                 [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [42]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [43]:
# 傳入how='all'，將只丟棄全為NA的那些行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [45]:
# 傳入axis=1，丟棄列
data[4] = np.nan
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [57]:
# 若只想留下一部分觀測數據，可以用thresh參數實現
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = np.nan
df.ix[:2, 2] = np.nan
df

          0         1         2
0  0.804206       NaN       NaN
1 -0.417179       NaN       NaN
2  0.787623       NaN       NaN
3  0.820769       NaN  0.742513
4 -1.902494       NaN -0.997575
5  2.416098 -1.357462  0.012059
6  1.272519 -0.994899 -0.079894

In [50]:
df.dropna(thresh=3)

          0         1         2
5 -0.292731 -1.402681  0.651394
6  0.011623 -0.697348 -0.877389

#### 填充缺失數據
- 大多數情況而已，fillna方法是最主要的函數，通過一個常數調用fillna就會將缺失值替換為那個常數值

In [51]:
df.fillna(0)

          0         1         2
0  0.872276  0.000000  0.000000
1  1.487355  0.000000  0.000000
2 -0.881548  0.000000  0.000000
3 -1.411018  0.000000 -1.520664
4  0.768703  0.000000  1.590091
5 -0.292731 -1.402681  0.651394
6  0.011623 -0.697348 -0.877389

In [53]:
# 透過一個字典調用fillna，就可以實現對不同的列填充不同的值
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.872276  0.500000       NaN
1  1.487355  0.500000       NaN
2 -0.881548  0.500000       NaN
3 -1.411018  0.500000 -1.520664
4  0.768703  0.500000  1.590091
5 -0.292731 -1.402681  0.651394
6  0.011623 -0.697348 -0.877389

In [58]:
# fillna默認會返回新對象，但也可以對現有對象進行就地修改
df.fillna(0, inplace=True)
df

          0         1         2
0  0.804206  0.000000  0.000000
1 -0.417179  0.000000  0.000000
2  0.787623  0.000000  0.000000
3  0.820769  0.000000  0.742513
4 -1.902494  0.000000 -0.997575
5  2.416098 -1.357462  0.012059
6  1.272519 -0.994899 -0.079894

In [61]:
# 對reindex有效的那些插值方法也可用於fillna
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = np.nan
df.ix[4:, 2] = np.nan
df

          0         1         2
0  0.376952  0.110244 -1.111803
1 -0.838008 -0.292672  0.407126
2  0.444760       NaN -0.597393
3 -0.627192       NaN -0.351313
4  0.055380       NaN       NaN
5  1.283588       NaN       NaN

In [62]:
df.fillna(method='ffill')

          0         1         2
0  0.376952  0.110244 -1.111803
1 -0.838008 -0.292672  0.407126
2  0.444760 -0.292672 -0.597393
3 -0.627192 -0.292672 -0.351313
4  0.055380 -0.292672 -0.351313
5  1.283588 -0.292672 -0.351313

In [63]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.376952  0.110244 -1.111803
1 -0.838008 -0.292672  0.407126
2  0.444760 -0.292672 -0.597393
3 -0.627192 -0.292672 -0.351313
4  0.055380       NaN -0.351313
5  1.283588       NaN -0.351313

In [64]:
# 可以利用fillna實現許多功能，譬如，傳入Series的平均值或中位數
data = Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### fillna函數的參數
|參數|說明|
|---|----|
|value|用於填充缺失值得標量值或字典對象|
|method|插值方式。如果函數調用時未指定其他參數的話，默認值為"ffill"|
|axis|待填充的軸，默認axis=0|
|inplace|修改調用者對象而不產生副本|
|limit|(對於前向或後向填充)可以連續填充的最大數量|

### 層次化索引
- 層次化索引(hierarchical indexing)能在一個軸上擁有多個(兩個以上)索引級別。
- 即能以低維度形式處理高維度數據

In [65]:
# 帶有MultiIndex索引的Series的格式化輸出形式，索引之間的"間隔"表示"直接使用上面的標籤"
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.049769
   2   -0.343711
   3    0.516277
b  1    1.216197
   2    0.765295
   3   -0.059494
c  1    0.909171
   2   -1.118751
d  2    0.765376
   3   -0.371618
dtype: float64

In [66]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [67]:
# 選取數據子集
data['b']

1    1.216197
2    0.765295
3   -0.059494
dtype: float64

In [68]:
data['b':'c']

b  1    1.216197
   2    0.765295
   3   -0.059494
c  1    0.909171
   2   -1.118751
dtype: float64

In [69]:
data.ix[['b', 'd']]

b  1    1.216197
   2    0.765295
   3   -0.059494
d  2    0.765376
   3   -0.371618
dtype: float64

In [70]:
# 在"內層"中進行選取
data[:, 2]

a   -0.343711
b    0.765295
c   -1.118751
d    0.765376
dtype: float64

In [71]:
# 層次化索引在數據重塑和基於分組的操作(如透視表生成)中扮演重要的角色。譬如透過unstack方法重新安排到一個DataFrame中
data.unstack()

          1         2         3
a -0.049769 -0.343711  0.516277
b  1.216197  0.765295 -0.059494
c  0.909171 -1.118751       NaN
d       NaN  0.765376 -0.371618

In [72]:
# unstack的逆運算是stack
data.unstack().stack()

a  1   -0.049769
   2   -0.343711
   3    0.516277
b  1    1.216197
   2    0.765295
   3   -0.059494
c  1    0.909171
   2   -1.118751
d  2    0.765376
   3   -0.371618
dtype: float64

In [4]:
# 對於DataFrame，每條軸都可以有分層索引
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [7]:
# 各層都可以有名字(可以是字符串，也可以是別的Python對象)。如果指定了名稱，它們就會顯示在輸出中
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [75]:
# 透過列索引，選取列分組
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

#### 重新分級順序
- 若需要重新調整某條軸上各級別的順序，或根據指定級別上的值對數據進行排序
- swaplevel接受兩個級別編號或名稱，並返回一個互換了級別的新對象(但數據不會產生變化)

In [77]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [78]:
# sortlevel，根據單個級別中的值對數據進行排序(穩定的)。交換級別時，常常會用到sortlevel，最終結果就是有序的
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [79]:
# 在層次化索引的對象上，如果索引是按字典方式從外而內排序(即調用sortlevel(0)或sort_index()的結果)，數據選擇操作的性能要好很多
frame.swaplevel(0 ,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### 根據級別匯總統計
- 許多對DataFrame和Series的描述和匯總統計都有一個level選項，用於指定在某條軸上求和的級別

In [8]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [9]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#### 使用DataFrame的列
- 將DataFrame的一個或多個列當作行索引來用
- 或將行索引變成DataFrame的列

In [11]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [12]:
# DataFrame的set_index函數將其中一個或多個列轉換為行索引，並創建一個新的DataFrame
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [13]:
# 默認情況下，那些列會從DataFrame中移除，但也可以將其保留下來
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [14]:
# reset_index將層次化索引的級別會被轉移到列裡面
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### 其他有關pandas的話題
- 整數索引: 操作由整數索引的pandas對象，其與內置的Python數據結構(如列表和元祖)在索引語意上有些不同。

In [15]:
# 在此種情況下，雖然pandas會參考到整數索引，但沒有哪種方法能夠既不引入任何BUG有安全有效地解決該問題
ser = Series(np.arange(3.))
ser
# ser[-1]

0    0.0
1    1.0
2    2.0
dtype: float64

In [17]:
# 為了保持良好的一致性，若軸索引含有索引器，那麼根據整數進行數據選取的操作將總是面向標籤的，這也包括用ix進行切片
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [31]:
# 若需要可靠的、不考慮索引類型的、基於位置的索引，可以使用Series的iloc或iat方法和DataFrame的iloc方法
ser3 = Series(range(3), index=[-5, 1, 4])
ser3.iloc[1]

1

In [32]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])
frame.iloc[1]

0    2
1    3
Name: 0, dtype: int64

#### 面板數據
- pandas有一個Panel數據結構，可以將其看做一個三維版的DataFrame
- pandas的大部分開發工作都集中在表格型數據的操作上，因為這些數據更常見，而且層次化索引也使得多數情況下沒必要使用真正的N維數據

In [33]:
import pandas.io.data as web

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

In [ ]:
# Panel中的每一項(類似於DataFrame的列)都是一個DataFrame

In [ ]:
# 基於ix的標籤索引被推廣到三個維度，因此可以選則指定日期或日期範圍的所有數據
pdata.ix[:, '6/1/2012', :]

In [ ]:
pdata.ix['Adj Close', '5/22/2012':, :]

In [ ]:
# 另一個用於呈現面板數據(尤其是對拟合統計模型)的辦法是"堆積式的"DataFrame形式
stacked = [data.ix[:, '5/30/2012':, :].to_frame()

In [ ]:
# DataFrame有一個相應的to_panel方法，其為to_frame的逆運算
stacked.to_panel()